In [62]:
import pandas as pd

In [102]:
train = pd.read_csv('./examples/train.csv')
test = pd.read_csv('./examples/test.csv')

In [103]:
train.info

<bound method DataFrame.info of      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]>

In [104]:
titanic = train.loc[:,['Survived','Pclass','Sex','Age']] #원하는 열 뽑아오기
titanic['isFemale'] = [0 if titanic['Sex'][i]=='male' else 1 for i in range(891)]

In [105]:
titanic = titanic.fillna(titanic['Age'].median()) # 나이가 Nan이면 평균값으로 주기

In [77]:
test['isFemale'] = [0 if titanic['Sex'][i]=='male' else 1 for i in len(test)]
train['isFemale'] = [0 if titanic['Sex'][i]=='male' else 1 for i in len(891)]

In [106]:
titanic.isnull().sum() # null값이 있는지 체크

Survived    0
Pclass      0
Sex         0
Age         0
isFemale    0
dtype: int64

In [107]:
titanic

     Survived  Pclass     Sex   Age  isFemale
0           0       3    male  22.0         0
1           1       1  female  38.0         1
2           1       3  female  26.0         1
3           1       1  female  35.0         1
4           0       3    male  35.0         0
..        ...     ...     ...   ...       ...
886         0       2    male  27.0         0
887         1       1  female  19.0         1
888         0       3  female  28.0         1
889         1       1    male  26.0         0
890         0       3    male  32.0         0

[891 rows x 5 columns]

In [108]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       891 non-null    float64
 4   isFemale  891 non-null    int64
dtypes: float64(1), int64(3), object(1)
memory usage: 34.9+ KB

In [109]:
titanic['Survived'].sum()

342

In [110]:
titanic['isFemale'].sum()

314

In [115]:
titanic = titanic.sort_values(["isFemale", "Survived"], ascending=False)
titanic

     Survived  Pclass     Sex   Age  isFemale
0           0       3    male  22.0         0
4           0       3    male  35.0         0
5           0       3    male  28.0         0
6           0       1    male  54.0         0
7           0       3    male   2.0         0
..        ...     ...     ...   ...       ...
874         1       2  female  28.0         1
875         1       3  female  15.0         1
879         1       1  female  56.0         1
880         1       2  female  25.0         1
887         1       1  female  19.0         1

[891 rows x 5 columns]

In [112]:
titanic['isFemale'][313:315]

888    1
17     0
Name: isFemale, dtype: int64

In [113]:
titanic[:314]['Survived'].mean() # 여성 생존률

0.7420382165605095

In [142]:
titanic[314:]['Survived'].mean() #남성 생존률

0.38648180242634317

In [123]:
titanic = titanic.sort_values(["isFemale", "Survived"], ascending=True)
titanic

     Survived  Pclass     Sex   Age  isFemale
0           0       3    male  22.0         0
4           0       3    male  35.0         0
5           0       3    male  28.0         0
6           0       1    male  54.0         0
7           0       3    male   2.0         0
..        ...     ...     ...   ...       ...
874         1       2  female  28.0         1
875         1       3  female  15.0         1
879         1       1  female  56.0         1
880         1       2  female  25.0         1
887         1       1  female  19.0         1

[891 rows x 5 columns]

In [129]:
titanic = titanic.sort_values(["Pclass","Survived"], ascending=False)
(titanic['Pclass']==3).sum()

491

In [136]:
titanic[0:492] # idx = 491 부터 pclass = 2

     Survived  Pclass     Sex   Age  isFemale
36          1       3    male  28.0         0
65          1       3    male  28.0         0
74          1       3    male  32.0         0
81          1       3    male  29.0         0
107         1       3    male  28.0         0
..        ...     ...     ...   ...       ...
863         0       3  female  28.0         1
882         0       3  female  22.0         1
885         0       3  female  39.0         1
888         0       3  female  28.0         1
17          1       2    male  28.0         0

[492 rows x 5 columns]

In [132]:
titanic[:491]['Survived'].mean() 3등석 생존률

0.24236252545824846

In [133]:
(titanic['Pclass']==2).sum()

184

In [137]:
titanic[491:491+184]['Survived'].mean() # 2등석 생존률

0.47282608695652173

In [141]:
#titanic[670:680] # idx = 675부터 1등석

In [140]:
titanic[675:]['Survived'].mean() # 1등석 생존률

0.6296296296296297

In [149]:
titanic[titanic['Pclass'] == 3]['Survived'].mean() #1등석 생존률

0.24236252545824846

In [146]:
predictors = ['Pclass','isFemale','Age']
X_train = train[predictors].values
X_test = test[predictors].values
Y_train = train['Survived'].values
Y_test=train['Survived'].values

KeyError: "['isFemale'] not in index"